GopalSaraf/Practicals/PSDL/include/proc/pic18lf14k22.inc
// Register: VREFCON0
#define VREFCON0 VREFCON0
VREFCON0                                 equ 0FBAh
// bitfield definitions
VREFCON0_FVR1S0_POSN                     equ 0004h
VREFCON0_FVR1S0_POSITION                 equ 0004h
VREFCON0_FVR1S0_SIZE                     equ 0001h
VREFCON0_FVR1S0_LENGTH                   equ 0001h
VREFCON0_FVR1S0_MASK                     equ 0010h
VREFCON0_FVR1S1_POSN                     equ 0005h
VREFCON0_FVR1S1_POSITION                 equ 0005h
VREFCON0_FVR1S1_SIZE                     equ 0001h
VREFCON0_FVR1S1_LENGTH                   equ 0001h
VREFCON0_FVR1S1_MASK                     equ 0020h
VREFCON0_FVR1ST_POSN                     equ 0006h
VREFCON0_FVR1ST_POSITION                 equ 0006h
VREFCON0_FVR1ST_SIZE                     equ 0001h
VREFCON0_FVR1ST_LENGTH                   equ 0001h
VREFCON0_FVR1ST_MASK                     equ 0040h
VREFCON0_FVR1EN_POSN                     equ 0007h
VREFCON0_FVR1EN_POSITION                 equ 0007h
VREFCON0_FVR1EN_SIZE                     equ 0001h
VREFCON0_FVR1EN_LENGTH                   equ 0001h
VREFCON0_FVR1EN_MASK                     equ 0080h

// Register: VREFCON1
#define VREFCON1 VREFCON1
VREFCON1                                 equ 0FBBh
// bitfield definitions
VREFCON1_D1NSS_POSN                      equ 0000h
VREFCON1_D1NSS_POSITION                  equ 0000h
VREFCON1_D1NSS_SIZE                      equ 0001h
VREFCON1_D1NSS_LENGTH                    equ 0001h
VREFCON1_D1NSS_MASK                      equ 0001h
VREFCON1_D1PSS_POSN                      equ 0002h
VREFCON1_D1PSS_POSITION                  equ 0002h
VREFCON1_D1PSS_SIZE                      equ 0002h
VREFCON1_D1PSS_LENGTH                    equ 0002h
VREFCON1_D1PSS_MASK                      equ 000Ch
VREFCON1_DAC1OE_POSN                     equ 0005h
VREFCON1_DAC1OE_POSITION                 equ 0005h
VREFCON1_DAC1OE_SIZE                     equ 0001h
VREFCON1_DAC1OE_LENGTH                   equ 0001h
VREFCON1_DAC1OE_MASK                     equ 0020h
VREFCON1_D1LPS_POSN                      equ 0006h
VREFCON1_D1LPS_POSITION                  equ 0006h
VREFCON1_D1LPS_SIZE                      equ 0001h
VREFCON1_D1LPS_LENGTH                    equ 0001h
VREFCON1_D1LPS_MASK                      equ 0040h
VREFCON1_D1EN_POSN                       equ 0007h
VREFCON1_D1EN_POSITION                   equ 0007h
VREFCON1_D1EN_SIZE                       equ 0001h
VREFCON1_D1EN_LENGTH                     equ 0001h
VREFCON1_D1EN_MASK                       equ 0080h
VREFCON1_D1NSS0_POSN                     equ 0000h
VREFCON1_D1NSS0_POSITION                 equ 0000h
VREFCON1_D1NSS0_SIZE                     equ 0001h
VREFCON1_D1NSS0_LENGTH                   equ 0001h
VREFCON1_D1NSS0_MASK                     equ 0001h
VREFCON1_D1PSS0_POSN                     equ 0002h
VREFCON1_D1PSS0_POSITION                 equ 0002h
VREFCON1_D1PSS0_SIZE                     equ 0001h
VREFCON1_D1PSS0_LENGTH                   equ 0001h
VREFCON1_D1PSS0_MASK                     equ 0004h
VREFCON1_D1PSS1_POSN                     equ 0003h
VREFCON1_D1PSS1_POSITION                 equ 0003h
VREFCON1_D1PSS1_SIZE                     equ 0001h
VREFCON1_D1PSS1_LENGTH                   equ 0001h
VREFCON1_D1PSS1_MASK                     equ 0008h

// Register: VREFCON2
#define VREFCON2 VREFCON2
VREFCON2                                 equ 0FBCh
// bitfield definitions
VREFCON2_DAC1R_POSN                      equ 0000h
VREFCON2_DAC1R_POSITION                  equ 0000h
VREFCON2_DAC1R_SIZE                      equ 0005h
VREFCON2_DAC1R_LENGTH                    equ 0005h
VREFCON2_DAC1R_MASK                      equ 001Fh
VREFCON2_DAC1R0_POSN                     equ 0000h
VREFCON2_DAC1R0_POSITION                 equ 0000h
VREFCON2_DAC1R0_SIZE                     equ 0001h
VREFCON2_DAC1R0_LENGTH                   equ 0001h
VREFCON2_DAC1R0_MASK                     equ 0001h
VREFCON2_DAC1R1_POSN                     equ 0001h
VREFCON2_DAC1R1_POSITION                 equ 0001h
VREFCON2_DAC1R1_SIZE                     equ 0001h
VREFCON2_DAC1R1_LENGTH                   equ 0001h
VREFCON2_DAC1R1_MASK                     equ 0002h
VREFCON2_DAC1R2_POSN                     equ 0002h
VREFCON2_DAC1R2_POSITION                 equ 0002h
VREFCON2_DAC1R2_SIZE                     equ 0001h
VREFCON2_DAC1R2_LENGTH                   equ 0001h
VREFCON2_DAC1R2_MASK                     equ 0004h
VREFCON2_DAC1R3_POSN                     equ 0003h
VREFCON2_DAC1R3_POSITION                 equ 0003h
VREFCON2_DAC1R3_SIZE                     equ 0001h
VREFCON2_DAC1R3_LENGTH                   equ 0001h
VREFCON2_DAC1R3_MASK                     equ 0008h
VREFCON2_DAC1R4_POSN                     equ 0004h
VREFCON2_DAC1R4_POSITION                 equ 0004h
VREFCON2_DAC1R4_SIZE                     equ 0001h
VREFCON2_DAC1R4_LENGTH                   equ 0001h
VREFCON2_DAC1R4_MASK                     equ 0010h

// Register: CCP1CON
#define CCP1CON CCP1CON
CCP1CON                                  equ 0FBDh
// bitfield definitions
CCP1CON_CCP1M_POSN                       equ 0000h
CCP1CON_CCP1M_POSITION                   equ 0000h
CCP1CON_CCP1M_SIZE                       equ 0004h
CCP1CON_CCP1M_LENGTH                     equ 0004h
CCP1CON_CCP1M_MASK                       equ 000Fh
CCP1CON_DC1B_POSN                        equ 0004h
CCP1CON_DC1B_POSITION                    equ 0004h
CCP1CON_DC1B_SIZE                        equ 0002h
CCP1CON_DC1B_LENGTH                      equ 0002h
CCP1CON_DC1B_MASK                        equ 0030h
CCP1CON_P1M_POSN                         equ 0006h
CCP1CON_P1M_POSITION                     equ 0006h
CCP1CON_P1M_SIZE                         equ 0002h
CCP1CON_P1M_LENGTH                       equ 0002h
CCP1CON_P1M_MASK                         equ 00C0h
CCP1CON_CCP1M0_POSN                      equ 0000h
CCP1CON_CCP1M0_POSITION                  equ 0000h
CCP1CON_CCP1M0_SIZE                      equ 0001h
CCP1CON_CCP1M0_LENGTH                    equ 0001h
CCP1CON_CCP1M0_MASK                      equ 0001h
CCP1CON_CCP1M1_POSN                      equ 0001h
CCP1CON_CCP1M1_POSITION                  equ 0001h
CCP1CON_CCP1M1_SIZE                      equ 0001h
CCP1CON_CCP1M1_LENGTH                    equ 0001h
CCP1CON_CCP1M1_MASK                      equ 0002h
CCP1CON_CCP1M2_POSN                      equ 0002h
CCP1CON_CCP1M2_POSITION                  equ 0002h
CCP1CON_CCP1M2_SIZE                      equ 0001h
CCP1CON_CCP1M2_LENGTH                    equ 0001h
CCP1CON_CCP1M2_MASK                      equ 0004h
CCP1CON_CCP1M3_POSN                      equ 0003h
CCP1CON_CCP1M3_POSITION                  equ 0003h
CCP1CON_CCP1M3_SIZE                      equ 0001h
CCP1CON_CCP1M3_LENGTH                    equ 0001h
CCP1CON_CCP1M3_MASK                      equ 0008h
CCP1CON_DC1B0_POSN                       equ 0004h
CCP1CON_DC1B0_POSITION                   equ 0004h
CCP1CON_DC1B0_SIZE                       equ 0001h
CCP1CON_DC1B0_LENGTH                     equ 0001h
CCP1CON_DC1B0_MASK                       equ 0010h
CCP1CON_DC1B1_POSN                       equ 0005h
CCP1CON_DC1B1_POSITION                   equ 0005h
CCP1CON_DC1B1_SIZE                       equ 0001h
CCP1CON_DC1B1_LENGTH                     equ 0001h
CCP1CON_DC1B1_MASK                       equ 0020h
CCP1CON_P1M0_POSN                        equ 0006h
CCP1CON_P1M0_POSITION                    equ 0006h
CCP1CON_P1M0_SIZE                        equ 0001h
CCP1CON_P1M0_LENGTH                      equ 0001h
CCP1CON_P1M0_MASK                        equ 0040h
CCP1CON_P1M1_POSN                        equ 0007h
CCP1CON_P1M1_POSITION                    equ 0007h
CCP1CON_P1M1_SIZE                        equ 0001h
CCP1CON_P1M1_LENGTH                      equ 0001h
CCP1CON_P1M1_MASK                        equ 0080h

// Register: CCPR1
#define CCPR1 CCPR1
CCPR1                                    equ 0FBEh

// Register: CCPR1L
#define CCPR1L CCPR1L
CCPR1L                                   equ 0FBEh

// Register: CCPR1H
#define CCPR1H CCPR1H
CCPR1H                                   equ 0FBFh

// Register: ADCON2
#define ADCON2 ADCON2
ADCON2                                   equ 0FC0h
// bitfield definitions
ADCON2_ADCS_POSN                         equ 0000h
ADCON2_ADCS_POSITION                     equ 0000h
ADCON2_ADCS_SIZE                         equ 0003h
ADCON2_ADCS_LENGTH                       equ 0003h
ADCON2_ADCS_MASK                         equ 0007h
ADCON2_ACQT_POSN                         equ 0003h
ADCON2_ACQT_POSITION                     equ 0003h
ADCON2_ACQT_SIZE                         equ 0003h
ADCON2_ACQT_LENGTH                       equ 0003h
ADCON2_ACQT_MASK                         equ 0038h
ADCON2_ADFM_POSN                         equ 0007h
ADCON2_ADFM_POSITION                     equ 0007h
ADCON2_ADFM_SIZE                         equ 0001h
ADCON2_ADFM_LENGTH                       equ 0001h
ADCON2_ADFM_MASK                         equ 0080h
ADCON2_ADCS0_POSN                        equ 0000h
ADCON2_ADCS0_POSITION                    equ 0000h
ADCON2_ADCS0_SIZE                        equ 0001h
ADCON2_ADCS0_LENGTH                      equ 0001h
ADCON2_ADCS0_MASK                        equ 0001h
ADCON2_ADCS1_POSN                        equ 0001h
ADCON2_ADCS1_POSITION                    equ 0001h
ADCON2_ADCS1_SIZE                        equ 0001h
ADCON2_ADCS1_LENGTH                      equ 0001h
ADCON2_ADCS1_MASK                        equ 0002h
ADCON2_ADCS2_POSN                        equ 0002h
ADCON2_ADCS2_POSITION                    equ 0002h
ADCON2_ADCS2_SIZE                        equ 0001h
ADCON2_ADCS2_LENGTH                      equ 0001h
ADCON2_ADCS2_MASK                        equ 0004h
ADCON2_ACQT0_POSN                        equ 0003h
ADCON2_ACQT0_POSITION                    equ 0003h
ADCON2_ACQT0_SIZE                        equ 0001h
ADCON2_ACQT0_LENGTH                      equ 0001h
ADCON2_ACQT0_MASK                        equ 0008h
ADCON2_ACQT1_POSN                        equ 0004h
ADCON2_ACQT1_POSITION                    equ 0004h
ADCON2_ACQT1_SIZE                        equ 0001h
ADCON2_ACQT1_LENGTH                      equ 0001h
ADCON2_ACQT1_MASK                        equ 0010h
ADCON2_ACQT2_POSN                        equ 0005h
ADCON2_ACQT2_POSITION                    equ 0005h
ADCON2_ACQT2_SIZE                        equ 0001h
ADCON2_ACQT2_LENGTH                      equ 0001h
ADCON2_ACQT2_MASK                        equ 0020h

// Register: ADCON1
#define ADCON1 ADCON1
ADCON1                                   equ 0FC1h
// bitfield definitions
ADCON1_NVCFG_POSN                        equ 0000h
ADCON1_NVCFG_POSITION                    equ 0000h
ADCON1_NVCFG_SIZE                        equ 0002h
ADCON1_NVCFG_LENGTH                      equ 0002h
ADCON1_NVCFG_MASK                        equ 0003h
ADCON1_PVCFG_POSN                        equ 0002h
ADCON1_PVCFG_POSITION                    equ 0002h
ADCON1_PVCFG_SIZE                        equ 0002h
ADCON1_PVCFG_LENGTH                      equ 0002h
ADCON1_PVCFG_MASK                        equ 000Ch
ADCON1_NVCFG0_POSN                       equ 0000h
ADCON1_NVCFG0_POSITION                   equ 0000h
ADCON1_NVCFG0_SIZE                       equ 0001h
ADCON1_NVCFG0_LENGTH                     equ 0001h
ADCON1_NVCFG0_MASK                       equ 0001h
ADCON1_NVCFG1_POSN                       equ 0001h
ADCON1_NVCFG1_POSITION                   equ 0001h
ADCON1_NVCFG1_SIZE                       equ 0001h
ADCON1_NVCFG1_LENGTH                     equ 0001h
ADCON1_NVCFG1_MASK                       equ 0002h
ADCON1_PVCFG0_POSN                       equ 0002h
ADCON1_PVCFG0_POSITION                   equ 0002h
ADCON1_PVCFG0_SIZE                       equ 0001h
ADCON1_PVCFG0_LENGTH                     equ 0001h
ADCON1_PVCFG0_MASK                       equ 0004h
ADCON1_PVCFG1_POSN                       equ 0003h
ADCON1_PVCFG1_POSITION                   equ 0003h
ADCON1_PVCFG1_SIZE                       equ 0001h
ADCON1_PVCFG1_LENGTH                     equ 0001h
ADCON1_PVCFG1_MASK                       equ 0008h
ADCON1_CHSN3_POSN                        equ 0003h
ADCON1_CHSN3_POSITION                    equ 0003h
ADCON1_CHSN3_SIZE                        equ 0001h
ADCON1_CHSN3_LENGTH                      equ 0001h
ADCON1_CHSN3_MASK                        equ 0008h

// Register: ADCON0
#define ADCON0 ADCON0
ADCON0                                   equ 0FC2h
// bitfield definitions
ADCON0_GO_NOT_DONE_POSN                  equ 0001h
ADCON0_GO_NOT_DONE_POSITION              equ 0001h
ADCON0_GO_NOT_DONE_SIZE                  equ 0001h
ADCON0_GO_NOT_DONE_LENGTH                equ 0001h
ADCON0_GO_NOT_DONE_MASK                  equ 0002h
ADCON0_ADON_POSN                         equ 0000h
ADCON0_ADON_POSITION                     equ 0000h
ADCON0_ADON_SIZE                         equ 0001h
ADCON0_ADON_LENGTH                       equ 0001h
ADCON0_ADON_MASK                         equ 0001h
ADCON0_GO_nDONE_POSN                     equ 0001h
ADCON0_GO_nDONE_POSITION                 equ 0001h
ADCON0_GO_nDONE_SIZE                     equ 0001h
ADCON0_GO_nDONE_LENGTH                   equ 0001h
ADCON0_GO_nDONE_MASK                     equ 0002h
ADCON0_CHS_POSN                          equ 0002h
ADCON0_CHS_POSITION                      equ 0002h
ADCON0_CHS_SIZE                          equ 0004h
ADCON0_CHS_LENGTH                        equ 0004h
ADCON0_CHS_MASK                          equ 003Ch
ADCON0_DONE_POSN                         equ 0001h
ADCON0_DONE_POSITION                     equ 0001h
ADCON0_DONE_SIZE                         equ 0001h
ADCON0_DONE_LENGTH                       equ 0001h
ADCON0_DONE_MASK                         equ 0002h
ADCON0_CHS0_POSN                         equ 0002h
ADCON0_CHS0_POSITION                     equ 0002h
ADCON0_CHS0_SIZE                         equ 0001h
ADCON0_CHS0_LENGTH                       equ 0001h
ADCON0_CHS0_MASK                         equ 0004h
ADCON0_CHS1_POSN                         equ 0003h
ADCON0_CHS1_POSITION                     equ 0003h
ADCON0_CHS1_SIZE                         equ 0001h
ADCON0_CHS1_LENGTH                       equ 0001h
ADCON0_CHS1_MASK                         equ 0008h
ADCON0_CHS2_POSN                         equ 0004h
ADCON0_CHS2_POSITION                     equ 0004h
ADCON0_CHS2_SIZE                         equ 0001h
ADCON0_CHS2_LENGTH                       equ 0001h
ADCON0_CHS2_MASK                         equ 0010h
ADCON0_CHS3_POSN                         equ 0005h
ADCON0_CHS3_POSITION                     equ 0005h
ADCON0_CHS3_SIZE                         equ 0001h
ADCON0_CHS3_LENGTH                       equ 0001h
ADCON0_CHS3_MASK                         equ 0020h
ADCON0_NOT_DONE_POSN                     equ 0001h
ADCON0_NOT_DONE_POSITION                 equ 0001h
ADCON0_NOT_DONE_SIZE                     equ 0001h
ADCON0_NOT_DONE_LENGTH                   equ 0001h
ADCON0_NOT_DONE_MASK                     equ 0002h
ADCON0_nDONE_POSN                        equ 0001h
ADCON0_nDONE_POSITION                    equ 0001h
ADCON0_nDONE_SIZE                        equ 0001h
ADCON0_nDONE_LENGTH                      equ 0001h
ADCON0_nDONE_MASK                        equ 0002h
ADCON0_GO_DONE_POSN                      equ 0001h
ADCON0_GO_DONE_POSITION                  equ 0001h
ADCON0_GO_DONE_SIZE                      equ 0001h
ADCON0_GO_DONE_LENGTH                    equ 0001h
ADCON0_GO_DONE_MASK                      equ 0002h
ADCON0_GO_POSN                           equ 0001h
ADCON0_GO_POSITION                       equ 0001h
ADCON0_GO_SIZE                           equ 0001h
ADCON0_GO_LENGTH                         equ 0001h
ADCON0_GO_MASK                           equ 0002h
ADCON0_GODONE_POSN                       equ 0001h
ADCON0_GODONE_POSITION                   equ 0001h
ADCON0_GODONE_SIZE                       equ 0001h
ADCON0_GODONE_LENGTH                     equ 0001h
ADCON0_GODONE_MASK                       equ 0002h

